# переменная - это объект,который сохраняется в память
a = 3  # 3-значение, a-переменная; 3 это int(целое число); int-тип данных
b = 5

c = 2.5  # 2.5 - это Float(дробное число)
num1 = 1.5

d = True  # True - это bool(логический тип)
e = False

name = 'Миша'  # 'Миша' - str(строковый тип); все что внутри кавычек - это простой текст
my_str = '3jei3je2i3jifji23jri2rj2ij23j.-'

fruits = ['банан',
          'апельсин']  # list(список); пишется в квадратных скобках , элементы внутри списка перечисляются через запятую
# элементы могут быть любыми типами данных
some_list = [1, True, 'b', 6, 1.5, [1.5, 'f', 1.6], 'j'] # в этом списке 7 элементов
#  списки являются изменяемым типом данных(объект можно изменить(есть методы для добавления/удаления/изменения порядка))
# списки являются упорядоченным типом данных(у элементов списка есть индексы, каждый элемент списка можно получить/изменить/удалить по его индексу)
print(some_list[3])# обращение к значению под 3 индексом(значение 6),
